# Data Merge

In [6]:
import pandas as pd

# create dataset
data1 = {
    "id" : [1,2,3],
    "name" : ["rohit", "jatin", "rahul"],
    "age" : [18,19,20]
}
df1 = pd.DataFrame(data1)
# Additional data
data2 = {
    "id" : [1,2,3],
    "city" : ["ganganager", "bikaner", "ganganger"],
    "occupation" : ["MLengineer", "docter", "farmer"]
}
df2 = pd.DataFrame(data2)

# Merging dataframe on 'id'
merge_df = pd.merge(df1, df2, on="id", how="inner")
merge_df

   id   name  age        city  occupation
0   1  rohit   18  ganganager  MLengineer
1   2  jatin   19     bikaner      docter
2   3  rahul   20   ganganger      farmer

---
# Concatination

In [1]:
import pandas as pd

# create data1
data1 = {'Name' : ['rohit', 'kartik', 'anuj'], 'age' : [18,19,20]}
# create data2
data2 = {'Name' : ['karan', 'rahul', 'vinod'], 'age' : [21,22,23]}
# create data3
data3 = {'address': ['anupgarh', 'gharsana', '4lm'], 'province' : ['rajasthan','rajasthan', 'rajasthan']}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3 = pd.DataFrame(data3)

# concatenating rows
concatenated_row = pd.concat([df1, df2])

#concatenating columns 
concatenated_column = pd.concat([df1, df3], axis=1)

concatenated_row, concatenated_column

(     Name  age
 0   rohit   18
 1  kartik   19
 2    anuj   20
 0   karan   21
 1   rahul   22
 2   vinod   23,
      Name  age   address   province
 0   rohit   18  anupgarh  rajasthan
 1  kartik   19  gharsana  rajasthan
 2    anuj   20       4lm  rajasthan)